INTERNET DRAFT						    Kent Leung
Category: Individual submission                               Cisco Systems
Title: draft-subbarao-mobileip-multipleip-00.txt            Madhavi Subbarao
Expires Septemer 2001                                         Cisco Systems
Mobile IP Working Group


                 Mobile IP NAI with Multiple Static IP Address Flows
                  draft-subbarao-mobileip-multipleip-00.txt

Status of this Memo

This document is an Internet Draft and is in full compliance with
all provisions of Section 10 of RFC2026.

Internet Drafts are working documents of the Internet Engineering
Task Force (IETF), its Areas, and its Working Groups.  Note that
other groups may also distribute working documents as Internet
Drafts.

Internet Drafts are draft documents valid for a maximum of six
months.  Internet Drafts may be updated, replaced, or obsoleted by
other documents at any time.  It is inappropriate to use Internet
Drafts as reference material or to cite them other than as "work in
progress".

The list of current Internet Drafts can be accessed at
http://www.ietf.org/ietf/1id-abstracts.txt

The list of Internet Draft Shadow Directories can be accessed at
http://www.ietf.org/shadow.html.


Abstract

A Network Access Identifier can be added to a Mobile IP Registration
Request to identify a user.  Users may want to open several
simultaneous sessions  using the same NAI from the same or different
devices with a unique IP address for each session.  The functionality
defined in this draft can be used to allow multiple static IP address
flows using the same NAI.


1. Introduction

A Mobile IP Registration Request may carry a Network Access
Identifier (NAI) [1,2] that serves to identify the user requesting
access to the network.  The NAI is used to also identify the necessary 
security assocation with the Home Agent (HA) or AAA server.  With the
abundance of mobile devices, a given user may want to open multiple,
simultaneous Mobile IP sessions/services from the same or different
devices. Currently, an NAI can only support a single Mobile IP flow.

In this draft, we specify the functionality to allow for multiple
static IP address flows using the same NAI.  A mobility binding is
then identified by the combination of NAI and MN home IP address.  The
functionality specified herein defines the behavior to support
multiple static IP address flows using the same NAI in a wireless
network deployment using Mobile IP, e.g., in a cdma2000 network [3].


2. Mobile Node Considerations

In order to support multiple IP address flows for an NAI, the Mobile
Node (MN) and HA (or Home AAA server) MUST be preconfigured with valid
static home IP addresses that the MN may use to register with the HA.
The MN SHOULD send a Registration Request (RRQ) with its NAI and one
of these valid static home IP addresses to the HA.  

Upon receipt of a Registration Reply (RPY), MN MUST use the home IP 
address returned by the HA for any subsequent RRQs pertaining to that
session. If there is an error in the RPY, the MN MUST proceed as
outlined in [4]. 


3.  Foreign Agent Considerations

If an FA receives an RRQ from an MN with an NAI and an MN home address,
the FA SHOULD index its pending registration records using the
combination of NAI/MN home address. 

Upon receipt of an RPY from an HA, the FA SHOULD search its pending
registration table based on NAI/MN home address pair.  If it does not
find an entry in this way, it SHOULD search the table based on the NAI
and low-order 32 bits of the Identifier field in the RPY (this
provides backward compatibility for dynamic address allocation using
NAI and also if another authorized MN home address is returned by the HA).


4.  Home Agent Considerations
  
If an HA receives an RRQ with an NAI Extension and MN home address,
the HA MUST first authenticate the  RRQ as usual [1,3].  The HA MUST
then check the  validity of the MN home address against the
preconfigured home IP addresses for the MN.  The HA MAY authorize the
MN home addresses against addresses configured via AAA or a local
pool.   If the MN home address included in the RRQ is not an
authorized home address for the MN, the HA MUST reject the RRQ with
error code 129 (administratively prohibited) as given in [4].

If the MN home address is authorized but already being used, and
another valid home address for the MN is available, the HA MUST either 
return this address in its RPY or reject the RRQ with error
code 130 (insufficient resources) as given by [4].  If another valid
home address for the MN is not available, the HA MUST reject the RRQ with
error code 130 (insufficient resources) as given by [4]. 

If an HA receives a re-registration from an MN, the HA MUST authorize
the MN address as above and check that the MN address is the same 
address as in the existing mobility binding.  


5. IANA Considerations

This draft does not directly affect IANA.


6. Security Considerations

Mobile IP registration messages are authenticated, and the
authentication verified by the recipient.  The static home addresses
used by an MN are authorized by the HA as a valid home address for the
MN. 


7. IPv6 Considerations

As with the NAI extension for Mobile IP [1], support for multiple
static IP flows with NAI in IPv6 is outside the scope of this
document. Any of the methods suggested there for creating an attendant
function in the visited network could also make use of the
functionality described in this draft to support multiple, static IP
address flows/sessions. 


8.  Acknowledgements
The authors would like to thank Roy Jose and Anand Sundaresh Natarajan
for their insightful comments on the functionality specified in this draft.


9. References

[1] P. Calhoun and C. Perkins,  Mobile IP Network Access Identifier
      Extension for IPv4, RFC 2794, Internet Engineering Task Force,
      March 2000.

[2] B. Aboba and M. Beadles, The Network Access Identifier.
      RFC 2486, Internet
      Engineering Task Force, January 1999.

[3] TIA/EIA/IS-835, Wireless IP Network Standard, June 2000.

[4] C. Perkins,  IP Mobility Support for IPv4, revised,  Internet
      Draft, Internet Engineering Task Force,
      draft-ietf-mobileip-rfc2002-bis-01.txt, Work in progress, 
      January 2000.


Author's Addresses

   Questions about this memo can be directed to:

         Kent Leung
         Cisco Systems, Inc.
         170 West Tasman Drive
         San Jose, CA 95134
         USA
         email: kleung@cisco.com
         phone: +1 408 526 5030
         fax:   +1 408 526 4952

	 Madhavi Subbarao
	 Cisco Systems, Inc.
	 7025 Kit Creek Road
	 Research Triangle Park, NC 27709
	 USA
	 email: msubbara@cisco.com
	 phone: +1 919 392 8387

Expires September 2001
